resources/currency.json

{
    "url": "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso",
    "requestTemplate": "<?xml version=\"1.0\" encoding=\"utf-8\"?><soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\"><soap:Body><CountryCurrency xmlns=\"http://www.oorsprong.org/websamples.countryinfo\"><sCountryISOCode>{{ payload.countryName }}</sCountryISOCode></CountryCurrency></soap:Body></soap:Envelope>",
    "responseTemplate": "{\"tr_ISOCode\": \"{{soap:Envelope.soap:Body.[0].m:CountryCurrencyResponse.[0].m:CountryCurrencyResult.[0].m:sISOCode.[0]}}\", \"tr_Name\": \"{{soap:Envelope.soap:Body.[0].m:CountryCurrencyResponse.[0].m:CountryCurrencyResult.[0].m:sName.[0]}}\"}",
    "format": "text/xml; charset=utf-8",
    "method": "POST",
    "type": "SOAP"
}